{
    "courses": [
      {
        "id": 1,
        "title": "مقدمة في البرمجة",
        "category": "تكنولوجيا",
        "description": "تعلم أساسيات البرمجة من خلال تمارين عملية ومشاريع واقعية. يغطي هذا الدورة مفاهيم البرمجة الأساسية بما في ذلك المتغيرات، وأنواع البيانات، وهياكل التحكم، والخوارزميات الأساسية. مثالي للمبتدئين الذين يرغبون في بدء مسيرة مهنية في تطوير البرمجيات أو تحسين مهارات حل المشكلات.",
        "date": "2024-09-15",
        "image": "/images/programing.webp",
        "location": "عبر الإنترنت",
        "price": 300
      },
      {
        "id": 2,
        "title": "مقدمة في التسويق",
        "category": "الأعمال",
        "description": "أساسيات التسويق الرقمي بما في ذلك تحسين محركات البحث (SEO)، التسويق عبر وسائل التواصل الاجتماعي، التسويق بالمحتوى، والإعلانات عبر الإنترنت. تم تصميم هذه الدورة لتقديم مقدمة شاملة حول مشهد التسويق الرقمي، مما يساعدك على فهم الاستراتيجيات والأدوات الأساسية للترويج الفعّال للمنتجات والخدمات.",
        "date": "2024-09-20",
        "location": "نيويورك",
        "image": "/images/marketing.webp",
        "price": 200
      },
      {
        "id": 3,
        "title": "تصميم الجرافيك",
        "category": "تصميم",
        "description": "مقدمة في مبادئ تصميم الجرافيك، تغطي المفاهيم الرئيسية مثل الخطوط، نظرية الألوان، التخطيط، والتسلسل البصري. توفر هذه الدورة المهارات العملية والتقنيات اللازمة لإنشاء تصميمات جذابة بصريًا لكل من الوسائط المطبوعة والرقمية باستخدام أدوات وبرامج الصناعة.",
        "date": "2024-09-22",
        "location": "سان فرانسيسكو",
        "image": "/images/graphicdesign.webp",
        "price": 130
      },
      {
        "id": 4,
        "title": "أساسيات تصميم واجهات المستخدم وتجربة المستخدم",
        "category": "UI/UX",
        "description": "مقدمة في المفاهيم الأساسية في تصميم واجهات المستخدم وتجربة المستخدم. تعلم عن أبحاث المستخدمين، تصميم الأسلاك، النماذج الأولية، واختبار القابلية للاستخدام. تركز هذه الدورة على إنشاء منتجات رقمية بديهية وسهلة الاستخدام من خلال فهم احتياجات المستخدم وتطبيق أفضل ممارسات التصميم.",
        "date": "2024-10-01",
        "image": "/images/uiux.webp",
        "location": "عبر الإنترنت",
        "price": 250
      },
      {
        "id": 5,
        "title": "تحليل البيانات المتقدم",
        "category": "تكنولوجيا",
        "description": "تعميق فهمك لتحليل البيانات باستخدام تقنيات متقدمة مثل التعلم الآلي، التحليلات التنبؤية، وتصور البيانات. تغطي هذه الدورة الأساليب الإحصائية، التنقيب عن البيانات، وأدوات تحليل البيانات المعقدة، مما يزودك بالمهارات اللازمة لاستخلاص رؤى قابلة للتنفيذ واتخاذ قرارات مبنية على البيانات.",
        "date": "2024-10-05",
        "image": "/images/data1.webp",
        "location": "عبر الإنترنت",
        "price": 350
      },
      {
        "id": 6,
        "title": "القيادة في الأعمال",
        "category": "الأعمال",
        "description": "تطوير مهارات القيادة الأساسية لإدارة الفرق بفعالية وتحقيق النجاح التنظيمي. تغطي هذه الدورة نظريات القيادة، استراتيجيات التواصل، حل النزاعات، وإدارة التغيير. احصل على رؤى حول كيفية تحفيز الآخرين وقيادتهم، واتخاذ قرارات استراتيجية، وتعزيز قدراتك القيادية.",
        "date": "2024-10-10",
        "image": "/images/business1.webp",
        "location": "عبر الإنترنت",
        "price": 280
      },
      {
        "id": 7,
        "title": "تقنيات الرسم الرقمي",
        "category": "تصميم",
        "description": "استكشاف تقنيات متقدمة في الرسم الرقمي، بما في ذلك العمل بالفرش، الترصيف، وإنشاء القوام. تم تصميم هذه الدورة للفنانين الذين يرغبون في تحسين مهاراتهم في إنشاء الأعمال الفنية الرقمية، مع التركيز على تعزيز الإبداع وإتقان أدوات وأساليب الرسم الرقمي المختلفة.",
        "date": "2024-10-15",
        "location": "لوس أنجلوس",
        "image": "/images/marketing1.webp",
        "price": 220
      },
      {
        "id": 8,
        "title": "مقدمة في UI/UX",
        "category": "UI/UX",
        "description": "تعلم أساسيات تصميم واجهات المستخدم وتجربة المستخدم. تغطي هذه الدورة المواضيع الأساسية مثل مبادئ التصميم، تصميم الأسلاك، النماذج الأولية، وأبحاث المستخدم، مما يوفر أساسًا متينًا لإنشاء منتجات رقمية بديهية وفعّالة.",
        "date": "2024-11-01",
        "image": "/images/uiux2.webp",
        "price": 270,
        "location": "عبر الإنترنت"
      },
      {
        "id": 9,
        "title": "أساسيات الكتابة الإبداعية",
        "category": "فن",
        "description": "افتح الإبداع بداخلك مع تقنيات أساسية في الكتابة الإبداعية. تغطي هذه الدورة السرد القصصي، تطوير الشخصيات، وهيكل السرد. تعلم كيفية إنشاء قصص مقنعة، وتطوير أصوات فريدة، وتحسين أسلوب الكتابة الخاص بك من خلال تمارين عملية وملاحظات بناءة.",
        "date": "2024-11-10",
        "image": "/images/art1.webp",
        "location": "عبر الإنترنت",
        "price": 190
      },
      {
        "id": 10,
        "title": "مقدمة في التغذية",
        "category": "الصحة",
        "description": "اكتساب فهم أساسي لعلوم التغذية، بما في ذلك أدوار المغذيات الكبيرة والصغيرة، الإرشادات الغذائية، والممارسات الصحية للأكل. تستكشف هذه الدورة كيف تؤثر التغذية على الصحة العامة والرفاهية، مع تقديم نصائح عملية لتحسين نظامك الغذائي ونمط حياتك.",
        "date": "2024-11-15",
        "image": "/images/health1.webp",
        "location": "عبر الإنترنت",
        "price": 220
      },
      {
        "id": 11,
        "title": "التوعية بالصحة العقلية",
        "category": "الصحة",
        "description": "تعرف على قضايا الصحة العقلية، بما في ذلك الاضطرابات الشائعة، الأعراض، وخيارات العلاج. توفر هذه الدورة رؤى قيمة حول الرفاهية العقلية، إدارة الإجهاد، واستراتيجيات الدعم للأفراد والمجتمعات، بهدف تقليل الوصمة وتعزيز الوعي بالصحة العقلية.",
        "date": "2024-11-20",
        "image": "/images/health2.webp",
        "location": "عبر الإنترنت",
        "price": 250
      },
      {
        "id": 12,
        "title": "اللياقة وعلوم التمرين",
        "category": "الصحة",
        "description": "استكشاف مبادئ اللياقة وعلوم التمرين، بما في ذلك فسيولوجيا التمرين، تصميم البرامج، وتقييم اللياقة. تم تصميم هذه الدورة لمساعدتك على فهم العلم وراء النشاط البدني وكيفية إنشاء برامج تمرين فعّالة لتحسين الصحة والأداء.",
        "date": "2024-12-01",
        "image": "/images/health3.webp",
        "location": "عبر الإنترنت",
        "price": 280
      },
      {
        "id": 13,
        "title": "الصحة والعافية الشاملة",
        "category": "الصحة",
        "description": "اكتشف أساليب شاملة لتحقيق الصحة والعافية، بما في ذلك اليقظة الذهنية، التغذية، والعلاجات البديلة. تركز هذه الدورة على دمج الصحة الجسدية والعقلية والعاطفية، مع تقديم استراتيجيات عملية لتحقيق نمط حياة متوازن وصحي.",
        "date": "2024-12-10",
        "location": "شيكاغو",
        "image": "/images/health4.webp",
        "price": 300
      }
    ],
    "date": "تاريخ",
    "category": "فئة",
    "price": "سعر",
    "location": "موقع",
    "title": "عنوان",
    "description": "وصف"
  }
  